Ran Plan for 4 projects:

1. dir: `terraform/gp_2134/global/acm` workspace: `default`
1. dir: `terraform/gp_2134/global/ec2` workspace: `default`
1. dir: `terraform/gp_2134/global/vpc` workspace: `default`
1. dir: `terraform/np_5455/global/vpc` workspace: `default`

### 1. dir: `terraform/gp_2134/global/acm` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/atlantis-data/repos/mileslee-nsuslab/atlantis-test-miles/3/default/terraform/gp_2134/global/acm": exit status 1

Initializing the backend...
╷
│ Warning: Deprecated Parameters
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The following parameters have been deprecated. Replace them as follows:
│   * role_arn -> assume_role.role_arn
│ 
╵

╷
│ Error: Missing Required Value
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The attribute "key" is required by the backend.
│ 
│ Refer to the backend documentation for additional information which
│ attributes are required.
╵


```
</details>

---
### 2. dir: `terraform/gp_2134/global/ec2` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_vpc.vpc_network2 will be updated in-place
~ resource "aws_vpc" "vpc_network2" {
        id                                   = "vpc-0f4040439d6e05330"
      ~ tags                                 = {
          ~ "Name" = "terraform-network-np2" -> "terraform-network"
        }
      ~ tags_all                             = {
          ~ "Name" = "terraform-network-np2" -> "terraform-network"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.vpc_network3 will be created
+ resource "aws_vpc" "vpc_network3" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network"
        }
      + tags_all                             = {
          + "Name" = "terraform-network"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/gp_2134/global/ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-c6d798b9cb-1522425131.us-east-1.elb.amazonaws.com/lock?id=mileslee-nsuslab%252Fatlantis-test-miles%252Fterraform%252Fgp_2134%252Fglobal%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/gp_2134/global/ec2`
</details>
Plan: 1 to add, 1 to change, 0 to destroy.

---
### 3. dir: `terraform/gp_2134/global/vpc` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/atlantis-data/repos/mileslee-nsuslab/atlantis-test-miles/3/default/terraform/gp_2134/global/vpc": exit status 1

Initializing the backend...
╷
│ Warning: Deprecated Parameters
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The following parameters have been deprecated. Replace them as follows:
│   * role_arn -> assume_role.role_arn
│ 
╵

╷
│ Error: Missing Required Value
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The attribute "key" is required by the backend.
│ 
│ Refer to the backend documentation for additional information which
│ attributes are required.
╵


```
</details>

---
### 4. dir: `terraform/np_5455/global/vpc` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/atlantis-data/repos/mileslee-nsuslab/atlantis-test-miles/3/default/terraform/np_5455/global/vpc": exit status 1

Initializing the backend...
╷
│ Warning: Deprecated Parameters
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The following parameters have been deprecated. Replace them as follows:
│   * role_arn -> assume_role.role_arn
│ 
╵

╷
│ Error: Missing Required Value
│ 
│   on main.tf line 8, in terraform:
│    8:   backend "s3" {
│ 
│ The attribute "key" is required by the backend.
│ 
│ Refer to the backend documentation for additional information which
│ attributes are required.
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`